098_Мастер_Ра_разработка/src/DataProcessors/УстановитьТарифВНаряде/УстановитьТарифВНаряде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановитьТарифВНаряде</name>
</mdclass:DataProcessor>

098_Мастер_Ра_разработка/src/Enums/СпособыРасчетаТарифов/СпособыРасчетаТарифов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаТарифов</name>
  <enumValues>
    <name>КвадратныйМетр</name>
  </enumValues>
  <enumValues>
    <name>МетрПогонный</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Enums/СтатусыРаботников/СтатусыРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРаботников</name>
  <enumValues>
    <name>Печатник</name>
  </enumValues>
  <enumValues>
    <name>Техник</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Documents/НарядНаПроизводство/НарядНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НарядНаПроизводство</name>
  <registerRecords>AccumulationRegister.Материалы</registerRecords>
  <registerRecords>AccumulationRegister.Рулоны</registerRecords>
  <registerRecords>InformationRegister.Наряды</registerRecords>
  <attributes>
    <name>ДатаВыполненияНаряда</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийНачЦеха</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалСписанВКЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечати</name>
    <type>
      <types>EnumRef.РежимыПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиРезка</name>
    <type>
      <types>CatalogRef.РежимыПечатиРезка</types>
    </type>
  </attributes>
  <attributes>
    <name>Связан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаТарифа</name>
    <type>
      <types>EnumRef.СпособыРасчетаТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеЗадание</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФЗПцеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха1</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха2</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха3</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеНаряды</name>
    <attributes>
      <name>Наряд</name>
      <type>
        <types>DocumentRef.НарядНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолИзрасходМатериала_МП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериала</name>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭкземпляров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерРулона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Печатник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаРулона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыРаботников</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФЗП_ПоТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопФЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/Catalogs/ТарифыЦеха/ТарифыЦеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифыЦеха</name>
  <attributes>
    <name>КолТехников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолПечатников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентТехника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПечатника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатнаяМашина</name>
    <type>
      <types>CatalogRef.ПечатныеМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаТарифа</name>
    <type>
      <types>EnumRef.СпособыРасчетаТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрименения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автонаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

098_Мастер_Ра_разработка/src/DataProcessors/УстановитьТарифВНаряде/Forms/Форма/Module.bsl
&НаСервере
Процедура КомандаВыполнитьНаСервере()
	Для Каждого строкаТаблицы Из ТаблицаНарядов Цикл
		ДокументСсылка 	= строкаТаблицы.Наряд;
		
		Структура = ПолучитьДанныеДлятарифа(ДокументСсылка);	
		ТарифЦехаПоиск = ПолучитьТарифИзСправочника(Структура);
		
		Если Не ТарифЦехаПоиск = Справочники.ТарифыЦеха.ПустаяСсылка() Тогда
			ДокументОбъект 	= ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.ТарифЦеха1 = ТарифЦехаПоиск;
			ДокументОбъект.ТарифЦеха  = ТарифЦехаПоиск.Тариф;
			Попытка
				ДокументОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	КомандаВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	ТаблицаНарядов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НарядНаПроизводство.Ссылка КАК Наряд,
		|	НарядНаПроизводство.ТарифЦеха1 КАК Тариф
		|ИЗ
		|	Документ.НарядНаПроизводство КАК НарядНаПроизводство
		|ГДЕ
		|	НарядНаПроизводство.Проведен
		|	И НарядНаПроизводство.ТарифЦеха1 = ЗНАЧЕНИЕ(Справочник.ТарифыЦеха.ПустаяСсылка)
		|	И НарядНаПроизводство.Дата > НАЧАЛОПЕРИОДА(&Дата, Год)";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаНарядов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДлятарифа(ДокументСсылка)
	
	Структура = ПолучитьСтруктуруРаботников();
	Структура.Вставить("ДокуменСсылка", ДокументСсылка);
	
	Структура = ПолучитьКоличествоТехниковПечатников(Структура);
	
	Структура.Вставить("ВидРабот"				, ДокументСсылка.ТехническоеЗадание.ВидРабот);
	Структура.Вставить("ПечатнаяМашина"			, ДокументСсылка.ТехническоеЗадание.ПечатнаяМашина);
	Структура.Вставить("ОбщаяПлощадьИзображения", ДокументСсылка.ТехническоеЗадание.ОбщаяПлощадьИзображения);
	
	Если ЗначениеЗаполнено(ДокументСсылка.ТехническоеЗадание.ОбщаяПлощадьИзображения) Тогда 
		 Структура.Вставить("СпособРасчетаТарифа"	, Перечисления.СпособыРасчетаТарифов.КвадратныйМетр);		
	Иначе
		 Структура.Вставить("СпособРасчетаТарифа"	, Перечисления.СпособыРасчетаТарифов.МетрПогонный);		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоТехниковПечатников(Структура)

	счПечатник 	= 0;
	счТехник   	= 0;
	Тариф 		= 0;

	Для Каждого стрТЧ Из Структура.ДокуменСсылка.СоставБригады Цикл
		Если стрТЧ.Статус = Перечисления.СтатусыРаботников.Печатник Тогда
			счПечатник = счПечатник + 1;
		ИначеЕсли стрТЧ.Статус = Перечисления.СтатусыРаботников.Техник Тогда
			счТехник = счТехник + 1;
		КонецЕсли;
		Если Тариф = 0 Тогда
			Тариф = стрТЧ.Тариф1;
		КонецЕсли;	
	КонецЦикла;

	Структура.Вставить("счПечатник"	, счПечатник);
	Структура.Вставить("счТехник"	, счТехник);
	Структура.Вставить("Тариф"		, Тариф);
	
	Возврат Структура;
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруРаботников()
	
	Структура = Новый Структура();
	Структура.Вставить("счПечатник", 0);
	Структура.Вставить("счПечатник", 0);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьТарифИзСправочника(Структура)
	
	СправочникТариф = Справочники.ТарифыЦеха.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыЦеха.Ссылка,
		|	ТарифыЦеха.ДатаПрименения КАК ДатаПрименения
		|ИЗ
		|	Справочник.ТарифыЦеха КАК ТарифыЦеха
		|ГДЕ
		|	ТарифыЦеха.КолТехников = &КолТехников
		|	И ТарифыЦеха.КолПечатников = &КолПечатников
		|	И ТарифыЦеха.ВидРаботы = &ВидРаботы
		|	И ТарифыЦеха.ПечатнаяМашина = &ПечатнаяМашина
		|	И ТарифыЦеха.СпособРасчетаТарифа = &СпособРасчетаТарифа
		|	И ТарифыЦеха.Тариф = &Тариф
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПрименения УБЫВ";
	
	Запрос.УстановитьПараметр("КолТехников"			, Структура.СчТехник);
	Запрос.УстановитьПараметр("ПечатнаяМашина"		, Структура.ПечатнаяМашина);
	Запрос.УстановитьПараметр("СпособРасчетаТарифа"	, Структура.СпособРасчетаТарифа);
	Запрос.УстановитьПараметр("КолПечатников"		, Структура.счПечатник);
	Запрос.УстановитьПараметр("ВидРаботы"			, Структура.ВидРабот);
	Запрос.УстановитьПараметр("Тариф"				, Структура.Тариф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыЦеха.ВидРаботы = &ВидРаботы", "");
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыЦеха.ПечатнаяМашина = &ПечатнаяМашина", "");	
			РезультатЗапроса = Запрос.Выполнить();
		КонецЕсли;	
		
		Если РезультатЗапроса.Пустой() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Тариф не найден'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() = Ложь	Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СправочникТариф = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СправочникТариф;
	
КонецФункции
